{
  "questions": [
    "Saya lebih suka berfokus pada detail daripada pandangan besar.",
    "Saya merasa berenergi setelah berada dalam keramaian sosial.",
    "Saya cenderung berpikir secara logis dan obyektif.",
    "Saya lebih suka merencanakan kegiatan daripada mengikuti arus.",
    "Saya mudah bergaul dan cenderung membantu orang lain.",
    "Saya lebih suka mengandalkan intuisi daripada data konkret.",
    "Saya cenderung merasa nyaman dalam situasi terstruktur dan terorganisir.",
    "Saya lebih suka beradaptasi daripada tetap pada jadwal yang ketat.",
    "Saya lebih suka merencanakan sesuatu daripada mengambil tindakan impulsif.",
    "Saya lebih suka fakta daripada gagasan dan konsep abstrak.",
    "Saya sering berpikir tentang masa depan daripada masa sekarang.",
    "Saya lebih suka menghabiskan waktu sendiri daripada bersama banyak orang.",
    "Saya lebih suka memecahkan masalah dengan pemikiran logis daripada perasaan.",
    "Saya cenderung memikirkan perasaan orang lain dan berusaha membuat mereka bahagia.",
    "Saya memiliki perasaan yang kuat tentang apa yang benar dan salah.",
    "Saya suka menyelesaikan tugas lebih awal daripada menunda-nunda.",
    "Saya lebih suka memiliki rencana yang jelas daripada bermain sesuai situasi.",
    "Saya cenderung lebih fleksibel daripada kaku dalam menghadapi perubahan.",
    "Saya lebih suka berbicara dengan tegas daripada berbicara secara samar-samar.",
    "Saya lebih suka bekerja secara terstruktur daripada kreatif dan spontan.",
    "Saya lebih suka memikirkan dampak jangka panjang daripada hasil segera.",
    "Saya merasa lebih bahagia ketika membantu orang lain mencapai tujuannya.",
    "Saya cenderung berpikir kritis dan skeptis terhadap informasi baru.",
    "Saya suka berimajinasi dan memikirkan hal-hal yang tidak terlihat oleh orang lain.",
    "Saya lebih suka hidup dalam rutinitas daripada kejutan tak terduga.",
    "Saya sering merasa gugup atau cemas dalam situasi sosial.",
    "Saya lebih suka berbicara tentang ide-ide daripada perasaan pribadi.",
    "Saya cenderung berfokus pada tugas daripada berbicara dengan orang lain.",
    "Saya lebih suka mengikuti alasan daripada hati nurani.",
    "Saya cenderung bersikap skeptis terhadap aturan dan otoritas.",
    "Saya lebih suka mengikuti perasaan daripada logika saat membuat keputusan.",
    "Saya merasa lebih nyaman dalam lingkungan yang tenang dan sepi.",
    "Saya cenderung mengejar cita-cita dan tujuan yang tinggi.",
    "Saya lebih suka bermain sesuai situasi daripada memiliki rencana yang pasti.",
    "Saya merasa energik setelah menghabiskan waktu sendiri.",
    "Saya cenderung bersikap realistis daripada idealis.",
    "Saya lebih suka menghindari konflik daripada berkonfrontasi dengan orang lain.",
    "Saya lebih suka bekerja secara mandiri daripada dalam tim.",
    "Saya cenderung fokus pada kebutuhan jangka pendek daripada jangka panjang.",
    "Saya lebih suka menyusun rencana daripada mengambil tindakan tanpa rencana.",
    "Saya merasa energik dalam kerumunan orang dan acara sosial.",
    "Saya cenderung percaya pada intuisi daripada data ilmiah.",
    "Saya lebih suka menghindari perubahan besar dalam hidup saya.",
    "Saya lebih suka menyembunyikan perasaan saya daripada membuka diri kepada orang lain.",
    "Saya cenderung bersikap impulsif daripada berpikir panjang sebelum bertindak.",
    "Saya lebih suka memiliki jadwal yang ketat daripada fleksibilitas dalam waktu.",
    "Saya merasa lebih bahagia ketika menjalani kehidupan yang terstruktur.",
    "Saya lebih suka bekerja dalam lingkungan yang kreatif daripada terstruktur."
  ],
  "personalityDescriptions": {
    "ISTJ": "ISTJ adalah orang yang andal, tangguh, dan berorientasi pada detail. Mereka cenderung berpegang pada nilai-nilai tradisional dan menghormati otoritas. ISTJ adalah pemikir yang rasional dan dapat diandalkan.",
    "ISFJ": "ISFJ adalah orang yang peduli, memperhatikan detail, dan setia. Mereka cenderung peduli dengan kesejahteraan orang lain dan berusaha menciptakan harmoni. ISFJ adalah penyayang dan dapat diandalkan.",
    "INFJ": "INFJ adalah individu yang memiliki intuisi yang kuat, empati, dan pemikiran konseptual. Mereka cenderung peduli dengan pertumbuhan pribadi dan tujuan yang lebih besar dalam hidup. INFJ adalah pemimpin yang visi dan inspiratif.",
    "INTJ": "INTJ adalah individu yang cerdas, analitis, dan berfokus pada visi jangka panjang. Mereka cenderung berorientasi pada solusi dan berusaha mencapai tujuan secara efisien. INTJ adalah pemikir strategis.",
    "ISTP": "ISTP adalah individu yang penuh petualangan, logis, dan cenderung hidup dalam momen. Mereka cenderung terampil dalam menyelesaikan masalah teknis dan tindakan fisik. ISTP adalah pemecah masalah yang tangguh.",
    "ISFP": "ISFP adalah orang yang kreatif, seni, dan memperhatikan detail. Mereka cenderung hidup sesuai dengan nilai-nilai pribadi dan mengejar ekspresi kreatif. ISFP adalah seniman yang penuh inspirasi.",
    "INFP": "INFP adalah individu yang penuh idealisme, empati, dan pemikiran konseptual. Mereka cenderung mencari makna dalam kehidupan dan memperjuangkan nilai-nilai pribadi. INFP adalah pemimpin yang berintegritas.",
    "INTP": "INTP adalah individu yang cerdas, analitis, dan penuh dengan ide-ide kreatif. Mereka cenderung tertarik pada konsep dan teori. INTP adalah pemikir inovatif.",
    "ESTP": "ESTP adalah individu yang berani, praktis, dan suka dengan tantangan. Mereka cenderung mengejar kesenangan dan tindakan fisik. ESTP adalah pemimpin yang tegas.",
    "ESFP": "ESFP adalah orang yang menyenangkan, bersemangat, dan berorientasi pada tindakan. Mereka cenderung menikmati hidup dan berhubungan dengan orang lain. ESFP adalah penyemangat yang energik.",
    "ENFP": "ENFP adalah individu yang penuh semangat, kreatif, dan penuh ide. Mereka cenderung bersemangat untuk mengejar impian mereka dan bersosialisasi dengan orang lain. ENFP adalah pemimpin yang visioner.",
    "ENTP": "ENTP adalah individu yang cerdas, berpikir konseptual, dan suka tantangan intelektual. Mereka cenderung mengembangkan ide-ide inovatif dan menjadi wirausahawan. ENTP adalah pemikir strategis.",
    "ESTJ": "ESTJ adalah individu yang tangguh, logis, dan cenderung memegang kendali. Mereka cenderung menghormati aturan dan struktur sosial. ESTJ adalah pemimpin yang efisien.",
    "ESFJ": "ESFJ adalah orang yang peduli, berorientasi pada kebutuhan orang lain, dan suka menciptakan harmoni. Mereka cenderung menjadi pendukung yang setia dan ramah. ESFJ adalah pemimpin yang berperasaan.",
    "ENFJ": "ENFJ adalah individu yang penuh perasaan, sosial, dan berorientasi pada orang lain. Mereka cenderung menjadi pemimpin yang memotivasi dan peduli dengan kesejahteraan orang lain. ENFJ adalah pemimpin yang inspiratif.",
    "ENTJ": "ENTJ adalah individu yang cerdas, berorientasi pada tujuan, dan cenderung mengambil inisiatif. Mereka cenderung menjadi pemimpin yang berfokus pada hasil dan efisien. ENTJ adalah pemimpin yang tegas."
  },
  "responseScale": ["1 (Tidak Sama Sekali)", "2", "3", "4", "5 (Sangat Sama)"],
  "famousPeople": {
    "ISTJ": ["George Washington", "Warren Buffett", "Angela Merkel"],
    "ISFJ": ["Mother Teresa", "Queen Elizabeth II", "Jimmy Carter"],
    "INFJ": ["Nelson Mandela", "Gandhi", "Eleanor Roosevelt"],
    "INTJ": ["Isaac Newton", "Elon Musk", "Hillary Clinton"],
    "ISTP": ["Clint Eastwood", "Steve Jobs", "Amelia Earhart"],
    "ISFP": ["Michael Jackson", "Audrey Hepburn", "Lady Diana"],
    "INFP": ["William Shakespeare", "J.R.R. Tolkien", "Princess Diana"],
    "INTP": ["Albert Einstein", "Abraham Lincoln", "Marie Curie"],
    "ESTP": ["Ernest Hemingway", "Theodore Roosevelt", "Mick Jagger"],
    "ESFP": ["Marilyn Monroe", "Elvis Presley", "Justin Bieber"],
    "ENFP": ["Walt Disney", "Oscar Wilde", "Ariel (The Little Mermaid)"],
    "ENTP": ["Thomas Edison", "Steve Wozniak", "Catherine the Great"],
    "ESTJ": ["Franklin D. Roosevelt", "Angela Merkel", "George Washington"],
    "ESFJ": ["Pope Francis", "Jennifer Garner", "Taylor Swift"],
    "ENFJ": ["Barack Obama", "Oprah Winfrey", "Martin Luther King Jr."],
    "ENTJ": ["Steve Jobs", "Margaret Thatcher", "Bill Gates"]
  },
  "title": {
    "ISTJ": ["The Inspector"],
    "ISFJ": ["The Protector"],
    "INFJ": ["The Advocate"],
    "INTJ": ["The Architect"],
    "ISTP": ["The Crafter"],
    "ISFP": ["The Artist"],
    "INFP": ["The Mediator"],
    "INTP": ["The Thinker"],
    "ESTP": ["The Entrepreneur"],
    "ESFP": ["The Performer"],
    "ENFP": ["The Campaigner"],
    "ENTP": ["The Debater"],
    "ESTJ": ["The Executive"],
    "ESFJ": ["The Caregiver"],
    "ENFJ": ["The Protagonist"],
    "ENTJ": ["The Commander"]
  },
  "gambar": {
    "ISTJ": ["https://storage.cloud.google.com/img-mbti/img/ISTJ.png"],
    "ISFJ": ["https://storage.cloud.google.com/img-mbti/img/ISFJ.png"],
    "INFJ": ["https://storage.cloud.google.com/img-mbti/img/INFJ.png"],
    "INTJ": ["https://storage.cloud.google.com/img-mbti/img/INTJ.png"],
    "ISTP": ["https://storage.cloud.google.com/img-mbti/img/ISTP.png"],
    "ISFP": ["https://storage.cloud.google.com/img-mbti/img/ISFP.png"],
    "INFP": ["https://storage.cloud.google.com/img-mbti/img/INFP.png"],
    "INTP": ["https://storage.cloud.google.com/img-mbti/img/INTP.png"],
    "ESTP": ["https://storage.cloud.google.com/img-mbti/img/ESTP.png"],
    "ESFP": ["https://storage.cloud.google.com/img-mbti/img/ESFP.png"],
    "ENFP": ["https://storage.cloud.google.com/img-mbti/img/ENFP.png"],
    "ENTP": ["https://storage.cloud.google.com/img-mbti/img/ENTP.png"],
    "ESTJ": ["https://storage.cloud.google.com/img-mbti/img/ESTJ.png"],
    "ESFJ": ["https://storage.cloud.google.com/img-mbti/img/ESFJ.png"],
    "ENFJ": ["https://storage.cloud.google.com/img-mbti/img/ENFJ.png"],
    "ENTJ": ["https://storage.cloud.google.com/img-mbti/img/ENTJ.png"]
  },
  "interestQuestions": [
    "Apakah Anda menikmati berinteraksi dengan berbagai orang dan membangun hubungan sosial?",
    "Apakah Anda merasa senang saat membantu orang lain dan memberikan dukungan emosional?",
    "Apakah Anda suka berpartisipasi dalam kegiatan sosial atau amal untuk mendukung komunitas?",
    "Apakah Anda tertarik dalam pekerjaan yang melibatkan bekerja sama dan kolaborasi?",
    "Apakah Anda menikmati aktivitas fisik, seperti olahraga atau pekerjaan yang melibatkan penggunaan tangan?",
    "Apakah Anda menemukan kepuasan dalam merawat dan membantu hewan atau lingkungan sekitar Anda?",
    "Apakah Anda suka bekerja dengan alat-alat dan teknologi untuk menyelesaikan tugas?",
    "Apakah Anda tertarik dalam pekerjaan yang mengharuskan pemecahan masalah praktis?",
    "Apakah Anda suka menggali ide-ide baru dan mengeksplorasi konsep-konsep yang kompleks?",
    "Apakah Anda merasa terpuaskan ketika Anda harus memecahkan masalah yang menantang?",
    "Apakah Anda senang membaca literatur ilmiah atau materi yang memerlukan analisis mendalam?",
    "Apakah Anda tertarik dengan penelitian dan eksperimen untuk menemukan informasi baru?",
    "Apakah Anda memiliki dorongan untuk memimpin dan mengambil inisiatif dalam situasi tertentu?",
    "Apakah Anda tertarik dengan peluang-peluang baru dan tantangan yang mendorong pertumbuhan?",
    "Apakah Anda senang berbicara di depan umum dan mempengaruhi orang lain?",
    "Apakah Anda memiliki semangat wirausaha dan mencari kesempatan untuk berkembang?",
    "Apakah Anda menikmati aktivitas fisik, seperti olahraga atau pekerjaan yang melibatkan penggunaan tangan?",
    "Apakah Anda menemukan kepuasan dalam merawat dan membantu hewan atau lingkungan sekitar Anda?",
    "Apakah Anda suka bekerja dengan alat-alat dan teknologi untuk menyelesaikan tugas?",
    "Apakah Anda tertarik dalam pekerjaan yang mengharuskan pemecahan masalah praktis?"
  ],
  "talentQuestions": [
    "Apakah Anda merasa senang berbicara dengan orang lain?",
    "Apakah Anda menikmati membaca buku atau artikel?",
    "Apakah Anda sering menggunakan kata-kata untuk menyampaikan ide?",
    "Apakah Anda merasa nyaman berbicara di depan umum?",
    "Apakah Anda suka memecahkan teka-teki matematika?",
    "Apakah Anda menikmati bekerja dengan angka dan data?",
    "Apakah Anda merasa mudah mengerti konsep-konsep matematika?",
    "Apakah Anda tertarik dengan tugas-tugas yang melibatkan perhitungan?",
    "Apakah Anda menikmati mendengarkan berbagai jenis musik?",
    "Apakah Anda pernah mencoba bermain alat musik?",
    "Apakah Anda merasa tertarik dengan irama dan melodi?",
    "Apakah Anda suka menyanyikan lagu-lagu favorit Anda?",
    "Apakah Anda senang berpartisipasi dalam olahraga atau aktivitas fisik?",
    "Apakah Anda merasa nyaman belajar melalui pengalaman langsung?",
    "Apakah Anda suka bergerak atau melakukan kegiatan fisik?",
    "Apakah Anda menikmati tugas-tugas yang melibatkan gerakan tubuh?",
    "Apakah Anda senang berinteraksi dengan orang lain?",
    "Apakah Anda merasa nyaman dalam kerjasama tim?",
    "Apakah Anda sering memberikan dukungan emosional kepada teman atau rekan kerja?",
    "Apakah Anda menikmati situasi sosial?",
    "Apakah Anda sering merenung atau introspeksi tentang diri sendiri?",
    "Apakah Anda dapat mengelola emosi dengan baik?",
    "Apakah Anda memiliki tujuan pribadi yang ingin dicapai?",
    "Apakah Anda menikmati waktu sendiri untuk refleksi?",
    "Apakah Anda suka melihat peta atau diagram?",
    "Apakah Anda bisa dengan mudah memvisualisasikan objek dalam dimensi tiga?",
    "Apakah Anda sering terlibat dalam desain visual atau seni?",
    "Apakah Anda merasa nyaman dalam situasi yang memerlukan pemahaman ruang?",
    "Apakah Anda merasa terhubung dengan alam atau lingkungan sekitar?",
    "Apakah Anda menikmati mengamati hewan atau tumbuhan?",
    "Apakah Anda sering merasa tertarik dengan fenomena alam?",
    "Apakah Anda merasa peduli dengan isu-isu lingkungan?"
  ]
}
